// data/questions/informatics.js
const INFO = [
{q:"Число 1010₂ в десятичной системе равно:",o:["16","12","10","8"],c:2,e:"1010₂ = 1×2³ + 0×2² + 1×2¹ + 0×2⁰ = 8+0+2+0 = 10₁₀"},
{q:"Число 101₂ в десятичной системе равно:",o:["6","7","3","5"],c:3,e:"101₂ = 1×2² + 0×2¹ + 1×2⁰ = 4+0+1 = 5₁₀"},
{q:"Число 15₁₀ в двоичной системе:",o:["1110₂","1111₂","1011₂","1010₂"],c:1,e:"15 = 8+4+2+1 = 2³+2²+2¹+2⁰ = 1111₂"},
{q:"Число 8₁₀ в двоичной системе:",o:["1001₂","1100₂","1000₂","111₂"],c:2,e:"Делим 8 на 2 пока не получим 0: 8/2=4, 4/2=2, 2/2=1. Остатки снизу вверх: 1000₂"},
{q:"Число 1111₂ в десятичной системе:",o:["14","13","15","16"],c:2,e:"1111₂ = 8+4+2+1 = 15₁₀"},
{q:"Число 16₁₀ в шестнадцатеричной системе:",o:["20₁₆","10₁₆","F₁₆","16₁₆"],c:1,e:"16₁₀ = 1×16¹ + 0×16⁰ = 10₁₆"},
{q:"Число A₁₆ в десятичной системе:",o:["15","10","11","12"],c:1,e:"A₁₆ = 10₁₀ (в шестнадцатеричной A=10, B=11, ..., F=15)"},
{q:"Число FF₁₆ в десятичной системе:",o:["255","240","225","256"],c:0,e:"FF₁₆ = 15×16 + 15 = 240+15 = 255₁₀"},
{q:"Число 7₈ в двоичной системе:",o:["111₂","110₂","101₂","1000₂"],c:0,e:"Каждую восьмеричную цифру заменяем 3 двоичными: 7₈ = 111₂ (7 = 4+2+1)"},
{q:"Число 10₈ в десятичной системе:",o:["2","8","16","10"],c:1,e:"10₈ = 1×8¹ + 0×8⁰ = 8₁₀"},
{q:"Сколько различных чисел можно представить 4 битами?",o:["16","4","8","32"],c:0,e:"2⁴ = 16 (от 0000₂=0 до 1111₂=15)"},
{q:"Сколько различных чисел можно представить 8 битами (1 байтом)?",o:["512","128","255","256"],c:3,e:"2⁸ = 256 (от 0 до 255)"},
{q:"Двоичное сложение: 1010₂ + 0011₂ =",o:["1111₂","1101₂","1001₂","1010₂"],c:1,e:"1010 + 0011 = 1101 (10+3=13)"},
{q:"Двоичное умножение: 101₂ × 10₂ =",o:["1000₂","1010₂","111₂","101₂"],c:1,e:"101×10 = 1010 (5×2=10)"},
{q:"Число 100₁₀ в двоичной системе:",o:["1100000₂","1100100₂","1111111₂","1010100₂"],c:1,e:"100 = 64+32+4 = 2⁶+2⁵+2² = 1100100₂"},
{q:"Младший бит в числе 1011₂:",o:["11","1","10","0"],c:1,e:"Младший (крайний правый) бит = 1"},
{q:"Старший бит в числе 1011₂:",o:["11","0","10","1"],c:3,e:"Старший (крайний левый) бит = 1"},
{q:"Система счисления с основанием 8:",o:["двоичная","восьмеричная","десятичная","шестнадцатеричная"],c:1,e:"Восьмеричная система: цифры 0-7"},
{q:"Система счисления с основанием 16:",o:["десятичная (основание 10)","двоичная (основание 2)","восьмеричная (основание 8)","шестнадцатеричная"],c:3,e:"Шестнадцатеричная: 0-9, A-F"},
{q:"В какой системе счисления работают компьютеры на физическом уровне?",o:["десятичной","восьмеричной","шестнадцатеричной","двоичной"],c:3,e:"Компьютеры используют двоичную систему (0 и 1, low/high voltage)"},
{q:"Сколько бит в 1 байте?",o:["2","8","4","16"],c:1,e:"1 байт = 8 бит. Бит — минимальная единица информации (0 или 1). Байт — базовая единица хранения"},
{q:"Сколько байт в 1 Кбайте?",o:["2048","1000","1024","512"],c:2,e:"1 Кбайт = 1024 байт = 2¹⁰ байт"},
{q:"Сколько Кбайт в 1 Мбайте?",o:["1000","2048","512","1024"],c:3,e:"1 Мбайт = 1024 Кбайт"},
{q:"Сколько бит в 2 Кбайтах?",o:["8192","2048","16384","4096"],c:2,e:"2 Кбайт = 2×1024 байт = 2048 байт = 2048×8 = 16384 бит"},
{q:"Количество информации I при выборе одного из N равновероятных событий:",o:["I = N×2","I = N/2","I = log₂N","I = 2^N"],c:2,e:"Формула Хартли: I = log₂N бит"},
{q:"При бросании монеты (2 исхода) количество информации:",o:["3 бита","1 бит","2 бита","0,5 бита"],c:1,e:"По формуле Хартли: I = log₂N. Для монеты N=2, значит I = log₂2 = 1 бит"},
{q:"При бросании игрального кубика (6 граней) количество информации:",o:["6 бит (максимум возможной информации)","1 бит (минимум информации)","≈2,58 бита","3 бита (всего 6 граней)"],c:2,e:"I = log₂6 ≈ 2,58 бита"},
{q:"Кодировка ASCII использует для одного символа:",o:["1 бит (0.125 байта)","4 байта (32 бита)","1 байт (8 бит)","2 байта (16 бит)"],c:2,e:"ASCII: 7 бит (расширенная 8 бит), 128 или 256 символов"},
{q:"Кодировка Unicode может использовать для символа:",o:["2 или более байт","4 бита или меньше","1 байт или меньше","всегда 1 байт или меньше"],c:0,e:"Unicode: UTF-8 (1-4 байта), UTF-16 (2-4 байта), поддержка всех языков"},
{q:"Растровое изображение 100×100 пикселей, 256 цветов (8 бит/пиксель). Объём:",o:["10 Кбайт","1 Мбайт","≈9,77 Кбайт","100 Кбайт"],c:2,e:"100×100×8 бит = 80000 бит = 10000 байт ≈ 9,77 Кбайт"},
{q:"Глубина цвета 24 бита позволяет кодировать:",o:["65536 цветов","1024 цвета","16,7 млн цветов","256 цветов"],c:2,e:"2²⁴ = 16 777 216 цветов (True Color: 8 бит на R, G, B)"},
{q:"Частота дискретизации звука 44,1 кГц означает:",o:["44100 Гц (частота звука)","44,1 Кбайт/с (скорость передачи)","44100 отсчётов в секунду","44100 бит (размер данных)"],c:2,e:"Частота дискретизации: количество измерений амплитуды сигнала в секунду"},
{q:"Монозвук, 8 бит, 8000 Гц, 10 секунд. Объём:",o:["800 байт","≈78,1 Кбайт","8 Кбайт","80 Кбайт"],c:1,e:"8000×8×10 = 640000 бит = 80000 байт ≈ 78,1 Кбайт"},
{q:"Избыточность информации — это:",o:["потеря данных (информации)","повторение для надёжности","сжатие (объёма данных)","кодирование (информационных потоков)"],c:1,e:"Избыточность: дублирование для защиты от ошибок (контрольные суммы, чётность)"},
{q:"Свойство информации — достоверность означает:",o:["информация полная","информация верна","информация доступна","информация нужна сейчас"],c:1,e:"Достоверность — отражает истинное состояние дел"},
{q:"Алгоритм — это:",o:["программа, состоящая из команд","последовательность действий для решения задачи","блок-схема, описывающая процесс","формула, используемая для вычислений"],c:1,e:"Алгоритм — точное предписание, определяющее процесс решения задачи"},
{q:"Свойство алгоритма — дискретность означает:",o:["понятность","конечность","применимость к разным данным","разбиение на шаги"],c:3,e:"Дискретность: алгоритм состоит из отдельных шагов (команд)"},
{q:"Свойство алгоритма — детерминированность означает:",o:["разбиение на шаги","однозначность результата","применимость к данным","конечность"],c:1,e:"Детерминированность: одинаковые входные данные → одинаковый результат"},
{q:"Свойство алгоритма — результативность означает:",o:["получение результата за конечное время","четкость и дискретность","ясность и простота","возможность применения в задачах"],c:0,e:"Результативность (конечность): алгоритм завершается за конечное число шагов"},
{q:"Свойство алгоритма — массовость означает:",o:["применимость к разным данным","предсказуемость результата","ясность и доступность","последовательность шагов"],c:0,e:"Массовость: алгоритм решает класс задач, а не одну конкретную"},
{q:"Линейный алгоритм — это:",o:["последовательное выполнение команд","рекурсия и возврат","алгоритм с ветвлением и условиями","алгоритм с циклом и повторениями"],c:0,e:"Линейный: команды выполняются друг за другом без ветвлений и циклов"},
{q:"Ветвление в алгоритме — это:",o:["выбор одного из путей в зависимости от условия","остановка выполнения алгоритма в определенный момент","повторение одного или нескольких действий","последовательность действий в определенном порядке"],c:0,e:"Ветвление (if-then-else): выполнение разных действий в зависимости от условия"},
{q:"Цикл в алгоритме — это:",o:["последовательность шагов, этапов","ветвление условий, выбор","повторение действий","рекурсия, вызов функции"],c:2,e:"Цикл: многократное выполнение одних и тех же действий"},
{q:"Блок-схема алгоритма использует:",o:["программный код","таблицы данных","геометрические фигуры","текстовые описания"],c:2,e:"Блок-схема: овал (начало/конец), прямоугольник (действие), ромб (условие), параллелограмм (ввод/вывод)"},
{q:"Цикл с предусловием (while) проверяет условие:",o:["в середине выполнения цикла","после выполнения тела цикла","перед выполнением тела цикла","не проверяет условие вообще"],c:2,e:"While: проверка условия ДО выполнения тела, может не выполниться ни разу"},
{q:"Цикл с постусловием (repeat-until) проверяет условие:",o:["после выполнения тела цикла","в середине выполнения цикла","перед выполнением тела цикла","не проверяет условие вообще"],c:0,e:"Repeat-until: проверка условия ПОСЛЕ выполнения, выполнится минимум 1 раз"},
{q:"Цикл со счётчиком (for) используется, когда:",o:["известно число повторений","условие сложное","нужна рекурсия","число повторений неизвестно"],c:0,e:"For: цикл с известным количеством итераций (for i := 1 to 10)"},
{q:"Трассировка алгоритма — это:",o:["рисование блок-схемы с элементами","отладка с исправлением ошибок","пошаговое выполнение с записью значений переменных","написание кода с учетом всех нюансов"],c:2,e:"Трассировка: пошаговое исполнение алгоритма для проверки правильности"},
{q:"Сложность алгоритма O(n) означает:",o:["квадратичная зависимость от размера данных","константная зависимость от размера данных","экспоненциальная зависимость от размера данных","линейная зависимость от размера данных"],c:3,e:"O(n): время растёт пропорционально n (например, поиск в массиве)"},
{q:"Сложность алгоритма O(n²) означает:",o:["квадратичная зависимость","линейная зависимость","константная сложность","логарифмическая зависимость"],c:0,e:"O(n²): время растёт как квадрат n (например, вложенные циклы)"},
{q:"Сложность алгоритма O(log n) характерна для:",o:["двоичного поиска","сортировки пузырьком","линейного поиска","перебора"],c:0,e:"O(log n): каждый шаг уменьшает задачу вдвое (бинарный поиск в отсортированном массиве)"},
{q:"Какой алгоритм выполнится быстрее для больших n: O(n) или O(n²)?",o:["O(n²)","O(n)","одинаково","зависит от данных"],c:1,e:"O(n) < O(n²) для больших n. Линейный быстрее квадратичного"},
{q:"Рекурсия — это:",o:["упорядоченная последовательность","вызов функцией самой себя","разветвляющийся выбор","повторяющийся процесс"],c:1,e:"Рекурсия: функция вызывает саму себя (например, факториал, Фибоначчи)"},
{q:"Базовый случай в рекурсии нужен для:",o:["ускорения и оптимизации","остановки рекурсии","ветвления и выбора","цикла и повторения"],c:1,e:"Базовый случай: условие выхода из рекурсии, иначе бесконечная рекурсия"},
{q:"Алгоритм сортировки пузырьком имеет сложность:",o:["O(1)","O(log n)","O(n²)","O(n)"],c:2,e:"Bubble sort: вложенные циклы, сложность O(n²)"},
{q:"Тип данных integer в Pascal предназначен для:",o:["дробных чисел","строк","целых чисел","символов"],c:2,e:"Integer: целые числа (обычно −32768 до 32767)"},
{q:"Тип данных real в Pascal предназначен для:",o:["целых чисел","символов","логических значений","дробных чисел"],c:3,e:"Real: вещественные (дробные) числа с плавающей запятой"},
{q:"Тип данных boolean может принимать значения:",o:["0 или 1","любое число","любой символ","true или false"],c:3,e:"Boolean: логический тип, истина (true) или ложь (false)"},
{q:"Тип данных char предназначен для:",o:["логического значения","числа","одного символа","строки"],c:2,e:"Char: один символ (буква, цифра, знак)"},
{q:"Тип данных string предназначен для:",o:["числа (целые, дробные)","логические значения (истина, ложь)","один символ (буква)","строк (последовательности символов)"],c:3,e:"String: строка символов (текст)"},
{q:"Оператор присваивания в Pascal:",o:["<-",":=","==","="],c:1,e:"x := 5; (присваивание значения переменной)"},
{q:"Оператор сравнения \"равно\" в Pascal:",o:["!=","=",":=","=="],c:1,e:"if x = 5 then ... (сравнение на равенство)"},
{q:"Оператор условия в Pascal:",o:["repeat-повторять","for-до-пока","while-пока","if-then-else"],c:3,e:"if условие then действие1 else действие2"},
{q:"Оператор цикла с предусловием в Pascal:",o:["repeat","while","for","if"],c:1,e:"while условие do действие"},
{q:"Оператор цикла с постусловием в Pascal:",o:["for (i := 1 to n)","repeat-until","if (условие) then","while (условие)"],c:1,e:"repeat действия until условие"},
{q:"Оператор цикла со счётчиком в Pascal:",o:["repeat","while","loop","for"],c:3,e:"for i := 1 to 10 do действие"},
{q:"Функция length(s) в Pascal возвращает:",o:["позицию символа","последний символ","длину строки s","первый символ"],c:2,e:"Функция length возвращает количество символов в строке. length('hello') = 5 букв"},
{q:"Функция sqr(x) в Pascal возвращает:",o:["x³","√x","2x","x²"],c:3,e:"sqr(5) = 25 (квадрат числа)"},
{q:"Функция sqrt(x) в Pascal возвращает:",o:["√x","x²","x³","2x"],c:0,e:"sqrt(25) = 5 (квадратный корень)"},
{q:"Массив — это:",o:["функция (программа)","строка (символов)","набор элементов одного типа","одна переменная (значение)"],c:2,e:"Массив: структура данных для хранения множества значений одного типа"},
{q:"Индексация массива в Pascal обычно начинается с:",o:["0, 1 (обычно)","любого числа (задаётся программистом)","зависит от типа, размера (данных)","1, 0 (в некоторых случаях)"],c:1,e:"array[1..10] или array[0..9] — индексы задаются явно"},
{q:"Двумерный массив — это:",o:["таблица (матрица)","строка (последовательность)","упорядоченный список (коллекция)","дерево (иерархическая структура)"],c:0,e:"array[1..3, 1..4] — 3 строки, 4 столбца"},
{q:"Процедура в Pascal:",o:["это массив данных","не возвращает значение","возвращает одно значение","это переменная типа"],c:1,e:"Procedure выполняет действия, не возвращает результат"},
{q:"Функция в Pascal:",o:["это цикл","возвращает значение","не возвращает значение","это массив"],c:1,e:"Function выполняет действия и возвращает результат"},
{q:"Оператор div в Pascal выполняет:",o:["остаток от деления","умножение","вещественное деление","целочисленное деление"],c:3,e:"7 div 2 = 3 (частное без остатка)"},
{q:"Логическая операция AND (И):",o:["истина, если хотя бы один операнд истинный","истина, если оба операнда истинны","истина, если хотя бы один из операндов ложный","истина, если один из операндов истинный, а другой ложный"],c:1,e:"1 AND 1 = 1; 1 AND 0 = 0; 0 AND 0 = 0"},
{q:"Логическая операция OR (ИЛИ):",o:["истина, если хотя бы один операнд истинен","исключающее ИЛИ между операндами","истина только если оба операнда истинны","инверсия логического значения"],c:0,e:"1 OR 0 = 1; 1 OR 1 = 1; 0 OR 0 = 0"},
{q:"Логическая операция NOT (НЕ):",o:["инверсия (отрицание)","операция И (конъюнкция)","исключающее ИЛИ (дизъюнкция)","операция ИЛИ (дизъюнкция)"],c:0,e:"NOT 1 = 0; NOT 0 = 1"},
{q:"Логическая операция XOR (исключающее ИЛИ):",o:["истина, если оба операнда истинны","истина, если операнды различны","истина, если оба операнда ложны","ложь, если операнды различны"],c:1,e:"1 XOR 0 = 1; 1 XOR 1 = 0; 0 XOR 0 = 0"},
{q:"Таблица истинности для A AND B, если A=1, B=0:",o:["1","неопределено","зависит","0"],c:3,e:"AND даёт 1 только если оба операнда равны 1. Здесь A=1, B=0, значит 1 AND 0 = 0"},
{q:"Таблица истинности для A OR B, если A=1, B=0:",o:["зависит","0","неопределено","1"],c:3,e:"OR даёт 1, если хотя бы один операнд равен 1. Здесь A=1, B=0, значит 1 OR 0 = 1"},
{q:"Закон де Моргана: NOT (A AND B) =",o:["(A OR B)","(NOT A) OR (NOT B)","(NOT A) AND (NOT B)","(A AND B)"],c:1,e:"Отрицание конъюнкции = дизъюнкция отрицаний"},
{q:"Закон де Моргана: NOT (A OR B) =",o:["A OR B с дополнительными условиями","A AND B с дополнительными параметрами","(NOT A) AND (NOT B)","(NOT A) OR (NOT B) с дополнительными условиями"],c:2,e:"Отрицание дизъюнкции = конъюнкция отрицаний"},
{q:"Центральный процессор (CPU) выполняет функции:",o:["охлаждения и вентиляции","управления и вычислений","ввода и вывода информации","хранения и обработки данных"],c:1,e:"ЦП: управление, арифметико-логические операции"},
{q:"Оперативная память (RAM) предназначена для:",o:["временного хранения данных и программ","ввода и обработки информации","постоянного хранения данных и программ","выполнения вычислений и операций"],c:0,e:"RAM: энергозависимая память, данные теряются при выключении"},
{q:"Постоянная память (ROM) предназначена для:",o:["вывода информации и данных, не теряющихся при выключении","хранения BIOS и данных, не теряющихся при выключении","вычислений и обработки данных, не теряющихся при выключении","временного хранения данных и информации, не теряющихся при выключении"],c:1,e:"ROM: энергонезависимая память, BIOS, firmware"},
{q:"Жёсткий диск (HDD) — это устройство:",o:["внешней памяти","ввода","оперативной памяти","процессора"],c:0,e:"HDD: постоянное хранилище данных (файлы, программы)"},
{q:"Устройства ввода:",o:["монитор, принтер, проектор","жёсткий диск, флешка, SSD","процессор, память, видеокарта","клавиатура, мышь, сканер"],c:3,e:"Ввод: передача информации в компьютер"},
{q:"Устройства вывода:",o:["процессор, память, видеокарта","монитор, принтер, колонки","сканер, копир, факс","клавиатура, мышь, тачпад"],c:1,e:"Вывод: передача информации из компьютера"},
{q:"Операционная система — это:",o:["игра для развлечения и досуга","браузер для просмотра веб-страниц","прикладная программа для работы с данными","системное ПО для управления компьютером"],c:3,e:"ОС: Windows, Linux, macOS — управляет ресурсами компьютера"},
{q:"Число 27₁₀ в двоичной системе:",o:["10111₂","11100₂","11001₂","11011₂"],c:3,e:"27 = 16+8+2+1 = 2⁴+2³+2¹+2⁰ = 11011₂"},
{q:"Число 110₂ в десятичной системе:",o:["6","5","4","7"],c:0,e:"110₂ = 1×2² + 1×2¹ + 0×2⁰ = 4+2+0 = 6₁₀"},
{q:"Число 37₈ в десятичной системе:",o:["31","28","37","24"],c:0,e:"37₈ = 3×8¹ + 7×8⁰ = 24+7 = 31₁₀"},
{q:"Число 1B₁₆ в десятичной системе:",o:["27","26","30","28"],c:0,e:"1B₁₆ = 1×16 + 11 = 16+11 = 27₁₀ (B=11)"},
{q:"Число 255₁₀ в шестнадцатеричной системе:",o:["F0₁₆","FE₁₆","FF₁₆","EF₁₆"],c:2,e:"255 = 15×16 + 15 = FF₁₆"},
{q:"Двоичное число 11001₂ перевести в восьмеричную:",o:["30₈","31₈","32₈","25₈"],c:1,e:"Разбиваем справа по 3 бита: 011 001 → 3 1 → 31₈"},
{q:"Число 64₁₀ в двоичной системе:",o:["1010000₂","1100000₂","1000000₂","100000₂"],c:2,e:"64 = 2⁶ = 1000000₂"},
{q:"Число 0₂ + 1₂ =",o:["0₂","10₂","1₂","11₂"],c:2,e:"Двоичное сложение: 0+1 = 1"},
{q:"Число 1₂ + 1₂ =",o:["10₂","0₂","11₂","1₂"],c:0,e:"1+1 = 10₂ (в двоичной 1+1 = 0, перенос 1)"},
{q:"Наибольшее число, записываемое 3 двоичными разрядами:",o:["9","7","6","8"],c:1,e:"111₂ = 4+2+1 = 7₁₀. Максимум при n разрядах: 2ⁿ−1 = 2³−1 = 7"},
{q:"В блок-схеме ромб обозначает:",o:["начало/конец (терминал)","ввод/вывод (данные)","действие (операция)","условие (ветвление)"],c:3,e:"Ромб — блок проверки условия с двумя выходами (да/нет)"},
{q:"В блок-схеме прямоугольник обозначает:",o:["условие (проверка)","начало/конец (старт/стоп)","действие (вычисление)","ввод/вывод (данные/результаты)"],c:2,e:"Прямоугольник — блок действия (присваивание, вычисление)"},
{q:"В блок-схеме параллелограмм обозначает:",o:["ввод/вывод данных","действие выполнения программы","условие проверки логики","начало/конец алгоритма"],c:0,e:"Параллелограмм — ввод или вывод данных"},
{q:"В блок-схеме овал обозначает:",o:["действие (операция)","ввод/вывод (данные)","начало или конец алгоритма","условие (проверка)"],c:2,e:"Овал (эллипс) — терминатор: начало или конец алгоритма"},
{q:"Дан массив: [5, 3, 8, 1, 4]. Результат сортировки по возрастанию:",o:["[8, 5, 4, 3, 1]","[1, 3, 4, 5, 8]","[5, 3, 8, 1, 4]","[3, 1, 4, 5, 8]"],c:1,e:"Сортировка по возрастанию: элементы располагаются от меньшего к большему"},
{q:"Поиск максимального элемента в массиве из n элементов требует:",o:["n сравнений","n² сравнений","log₂n сравнений","n−1 сравнений"],c:3,e:"Проходим массив один раз, сравнивая каждый элемент с текущим максимумом: n−1 сравнений"},
{q:"Что выведет алгоритм: s=0; для i от 1 до 3: s=s+i; вывести s",o:["5","10","3","6"],c:3,e:"s = 0+1+2+3 = 6"},
{q:"Что выведет алгоритм: a=1; пока a<10: a=a*2; вывести a",o:["16","10","32","8"],c:0,e:"a: 1→2→4→8→16. При a=16 условие a<10 ложно, выводится 16"},
{q:"Линейный поиск элемента в массиве из n элементов имеет сложность:",o:["O(log n)","O(n)","O(n²)","O(1)"],c:1,e:"В худшем случае просматриваем все n элементов"},
{q:"Какой тип алгоритма используется в конструкции if-then-else?",o:["рекурсия","цикл","линейный","ветвление"],c:3,e:"if-then-else — конструкция ветвления (выбор по условию)"},
{q:"Результат выполнения в Python: print(10 // 3)",o:["3","3.0","4","3.33"],c:0,e:"Оператор // — целочисленное деление. 10 // 3 = 3"},
{q:"Результат выполнения в Python: print(10 % 3)",o:["3","1","10","0"],c:1,e:"Оператор % — остаток от деления. 10 % 3 = 1 (10 = 3×3 + 1)"},
{q:"Результат выполнения в Python: print(2 ** 5)",o:["32","10","64","25"],c:0,e:"Оператор ** — возведение в степень. 2⁵ = 32"},
{q:"Что выведет код Python: x = 'Hello'; print(len(x))",o:["4","Hello","6","5"],c:3,e:"Функция len() возвращает длину строки. 'Hello' содержит 5 символов"},
{q:"Что выведет код Python: print(type(3.14))",o:["<class 'int'>","<class 'str'>","<class 'float'>","<class 'bool'>"],c:2,e:"3.14 — вещественное число, тип float"},
{q:"Оператор присваивания в Python:",o:["<-","=","==",":="],c:1,e:"В Python оператор = присваивает значение переменной: x = 5"},
{q:"Как объявить список (массив) в Python?",o:["array a[3]","a = {1, 2, 3}","a = [1, 2, 3]","a = (1, 2, 3)"],c:2,e:"Список (list) создаётся квадратными скобками: a = [1, 2, 3]"},
{q:"Индексация списка в Python начинается с:",o:["1","−1","0","любого числа"],c:2,e:"Первый элемент имеет индекс 0: a[0] — первый элемент"},
{q:"Что выведет: a = [10, 20, 30]; print(a[1])",o:["30","20","ошибку","10"],c:1,e:"a[1] — второй элемент списка (индексация с 0), то есть 20"},
{q:"Как записать цикл for в Python для чисел от 0 до 4?",o:["for (i=0; i<5; i++):","for i in range(4):","for i in range(5):","for i = 0 to 4:"],c:2,e:"range(5) генерирует числа 0, 1, 2, 3, 4"},
{q:"Что выведет код Python: s=''; for i in range(3): s += str(i); print(s)",o:["012","321","0 1 2","123"],c:0,e:"Цикл добавляет строки '0', '1', '2' → '012'"},
{q:"Оператор mod в Pascal выполняет:",o:["вещественное деление, дробь","вычисление остатка от деления","целочисленное деление, округление","умножение, произведение"],c:1,e:"7 mod 2 = 1 (остаток: 7 = 2×3 + 1)"},
{q:"Что выведет Pascal: a:=10; b:=3; write(a div b, ' ', a mod b);",o:["3 0","3 1","10 3","3.33 1"],c:1,e:"10 div 3 = 3, 10 mod 3 = 1. Вывод: 3 1"},
{q:"Функция в Python определяется ключевым словом:",o:["func","def","define","function"],c:1,e:"def имя_функции(параметры): — определение функции в Python"},
{q:"Что вернёт функция: def f(x): return x*2; print(f(5))",o:["52","5","25","10"],c:3,e:"f(5) = 5×2 = 10"},
{q:"Значение выражения: NOT (1 AND 0) =",o:["зависит от переменных","0","1","неопределено"],c:2,e:"1 AND 0 = 0. NOT 0 = 1"},
{q:"Значение выражения: (1 OR 0) AND (0 OR 1) =",o:["2","неопределено","0","1"],c:3,e:"1 OR 0 = 1; 0 OR 1 = 1; 1 AND 1 = 1"},
{q:"Значение выражения: NOT 1 OR NOT 0 =",o:["2","1","0","неопределено"],c:1,e:"NOT 1 = 0; NOT 0 = 1; 0 OR 1 = 1"},
{q:"Логическая формула A AND (A OR B) эквивалентна:",o:["A AND B","B","A","A OR B"],c:2,e:"Закон поглощения: A AND (A OR B) = A"},
{q:"Логическая формула A OR (A AND B) эквивалентна:",o:["A AND B","A OR B","B","A"],c:3,e:"Закон поглощения: A OR (A AND B) = A"},
{q:"Сколько строк в таблице истинности для 3 переменных?",o:["6","16","3","8"],c:3,e:"Для n переменных — 2ⁿ строк. 2³ = 8"},
{q:"Сколько строк в таблице истинности для 2 переменных?",o:["8","2","6","4"],c:3,e:"Для 2 переменных — 2² = 4 строки"},
{q:"Импликация A → B ложна только когда:",o:["A ложно, B истинно","оба ложны","оба истинны","A истинно, B ложно"],c:3,e:"Импликация ложна лишь при A=1, B=0. Из истины не следует ложь"},
{q:"Эквиваленция A ↔ B истинна, когда:",o:["оба истинны (или оба ложны)","оба ложны (или оба истинны)","хотя бы один истинен (или оба ложны)","оба одинаковы (оба истинны или оба ложны)"],c:3,e:"A ↔ B = 1 при A=B (оба 0 или оба 1)"},
{q:"Что является отрицанием высказывания «Все студенты сдали экзамен»?",o:["Все студенты не сдали экзамен","Существует студент, который не сдал экзамен","Некоторые студенты сдали экзамен","Ни один студент не сдал экзамен"],c:1,e:"Отрицание «для всех» — «существует хотя бы один, для которого не выполняется»"},
{q:"Сколько Мбайт в 1 Гбайте?",o:["1000","2048","1024","512"],c:2,e:"1 Гбайт = 1024 Мбайт = 2¹⁰ Мбайт"},
{q:"Файл размером 2 Мбайт — это сколько Кбайт?",o:["2000","1024","2048","4096"],c:2,e:"2 Мбайт = 2 × 1024 = 2048 Кбайт"},
{q:"Растровое изображение 200×300, глубина цвета 24 бита. Размер без сжатия:",o:["180 Кбайт","≈175,8 Кбайт","60 Кбайт","200 Кбайт"],c:1,e:"200×300×24 бит = 1 440 000 бит = 180 000 байт ≈ 175,8 Кбайт"},
{q:"Стерео звук, 16 бит, 44100 Гц, 5 секунд. Объём:",o:["≈861 Кбайт","220 Кбайт","1722 Кбайт","430 Кбайт"],c:0,e:"44100×16×2×5 = 7 056 000 бит = 882 000 байт ≈ 861 Кбайт (2 канала — стерео)"},
{q:"Сколько символов можно закодировать 16 битами?",o:["1024","32768","65536","256"],c:2,e:"2¹⁶ = 65536 символов (кодировка Unicode UTF-16)"},
{q:"Тактовая частота процессора измеряется в:",o:["байтах (B)","вольтах (V)","битах (bit)","герцах (ГГц)"],c:3,e:"Тактовая частота — число операций в секунду, единица — Гц (ГГц = гигагерц)"},
{q:"Кэш-память процессора предназначена для:",o:["для вывода данных на экран","для постоянного хранения данных","ускорения доступа к часто используемым данным","для подключения к сети и устройствам"],c:2,e:"Кэш — сверхбыстрая память между процессором и ОЗУ для часто используемых данных"},
{q:"Шина данных в компьютере служит для:",o:["выполнение вычислений в процессоре","передачи данных между устройствами","ввод данных с клавиатуры","хранение данных на носителе"],c:1,e:"Шина — набор проводников для обмена данными между компонентами компьютера"},
{q:"IP-адрес — это:",o:["адрес сайта в интернете","адрес электронной почты пользователя","имя файла на компьютере","уникальный адрес устройства в сети"],c:3,e:"IP-адрес (например, 192.168.1.1) — уникальный числовой идентификатор устройства в сети"},
{q:"Протокол HTTP используется для:",o:["передачи файлов","удалённого доступа","отправки почты","передачи веб-страниц"],c:3,e:"HTTP (HyperText Transfer Protocol) — протокол передачи гипертекста (веб-страниц)"},
{q:"URL — это:",o:["язык программирования Python","протокол передачи данных","адрес ресурса в интернете","тип файла JPEG"],c:2,e:"URL (Uniform Resource Locator) — адрес ресурса, например https://example.com/page"},
{q:"Протокол для отправки электронной почты:",o:["HTTP","FTP","TCP","SMTP"],c:3,e:"SMTP (Simple Mail Transfer Protocol) — протокол отправки электронной почты"},
{q:"База данных — это:",o:["текстовый файл для хранения и обработки данных","программа для обработки информации и данных","организованная совокупность данных для хранения и обработки","электронная таблица для анализа и обработки данных"],c:2,e:"БД — структурированное хранилище данных с возможностью поиска, добавления и изменения"},
{q:"Первичный ключ в базе данных — это:",o:["любое поле базы данных","название таблицы базы данных","тип данных записи","уникальный идентификатор записи"],c:3,e:"Первичный ключ (Primary Key) — поле, уникально идентифицирующее каждую запись в таблице"},
{q:"SQL-запрос для выборки всех записей из таблицы Students:",o:["SHOW Students","GET ALL Students","SELECT * FROM Students","READ * FROM Students"],c:2,e:"SELECT * FROM Students — выбрать все поля (*) из таблицы Students"},
];

export { INFO };
